Improved README flowchart
